<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Python_Data_Analytics_Course/blob/main/4_Problems/2_04_Pandas Pivot Tables.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

## ðŸŸ© Count Job Postings by Title and Country (2.4.1)

In [21]:
pivot_table = df.pivot_table(index=['job_title_short', 'job_country'], aggfunc='size')
pivot_table.head(10)

job_title_short   job_country
Business Analyst  Afghanistan      4
                  Albania         11
                  Algeria         21
                  Angola           1
                  Argentina      453
                  Armenia         29
                  Australia      928
                  Austria        738
                  Azerbaijan      16
                  Bahamas          5
dtype: int64

---

## ðŸŸ¨ Salary Stats by Job Title (2.4.2)

In [11]:
df.pivot_table(values='salary_year_avg', index='company_name', aggfunc=['max', 'min', 'mean']).head()

                                    max             min            mean
                        salary_year_avg salary_year_avg salary_year_avg
company_name
#twiceasnice Recruiting   120000.000000    61000.000000    77750.000000
/dev/color                125000.000000   125000.000000   125000.000000
0nward Select              92500.000000    92500.000000    92500.000000
1 Point System            137290.484375   137290.484375   137290.484375
1 Point System LLC.       170000.000000   170000.000000   170000.000000

---

## ðŸŸ¥ Sum Salary by Title and Country (2.4.3)

In [26]:
pivot_table = df[df['job_title_short'] == 'Data Scientist'].pivot_table(values='salary_year_avg', index=['company_name', 'job_country'], aggfunc='median')
pivot_table = pivot_table.reset_index()
pivot_table = pivot_table[pivot_table['salary_year_avg'] > 200000]
pivot_table.head(10)

            company_name    job_country  salary_year_avg
17                   ACT          Sudan         225000.0
18                   ACT  United States         225000.0
56                Abbott  United States         204000.0
116               Airbnb  United States         212500.0
117             Airtable          Sudan         215500.0
118             Airtable  United States         233500.0
132   Algo Capital Group          Sudan         325000.0
133   Algo Capital Group  United States         350000.0
162       Amadeus Search  United States         232500.0
189  Analog Devices, Inc  United States         375000.0

---